index.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: index
#+date: <2024-11-05 Tue>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.4 (Org mode 9.8-pre)
#+property: EXPORT_FILE_NAME: index.html
#+cite_export:
#+startup: indent fold
#+export_file_name: index.html
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
This is my /Fish/ shell configuration, as always, nothing fancy.
* ~/.config/fish/config.fish
  :PROPERTIES:
  :header-args: :tangle .config/fish/config.fish :padline no :shebang #!/usr/bin/env fish :mkdirp t
  :END:
  From all the shells I've used, this is the most recent. And it is intentionally not fully POSIX compliant, meaning porting POSIX compliant script may require significant rewrite.

  As for now, just to conditionals for when called as a login shell or when called interactively. Most people used /fish/ as an interactive shell only, meaning the default shell (usually /bash/) is still used for initializing. But when I used /fish/ I set it up as my default shell (using /chsh/).

  to check if you're in interactive or login shell, just run the following snippet:
  #+begin_src fish
    status --is-interactive || echo $status
  #+end_src

  and check its output
** interactive settings
#+begin_src fish
  if status is-interactive
      # Commands to run in interactive sessions can go here
      [ -d "$HOME/.local/bin" ] && set -x PATH $HOME/.local/bin $PATH

      # completions
      for dir in /usr/share/fish/completions \
          /usr/share/fish/vendor_completions.d \
          /usr/local/share/fish/completions \
          ~/.config/fish/completions
          if [ -d "$dir" ]
              for files in "$dir/*"
                  [ -f $files ] && source $files
              end
          end
      end
  end
#+end_src
** Login shell
This allow us to run /fish/ as a login shell, while still having all the environment variables I would typically have in /bash/[fn:1].
#+begin_src fish
  # source /etc/profile with bash
  if status is-login
      exec bash -c "test -e /etc/profile && source /etc/profile;\
      exec fish"
  end
#+end_src
* ~/config/fish/conf.d
Mostly just ports from my [[https://alexforsale.github.io/dotfiles-shells/][POSIX shell configuration]].
** 00-distro.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/00-distro.fish :padline no :shebang #!/usr/bin/env fish :mkdirp t
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/00-distro.fish
  # <alexforsale@yahoo.com>

  if [ -f /etc/os-release ]
      # freedesktop.org and systemd
      set -x DISTRO (grep '^ID=' /etc/os-release| sed 's/^ID=//')
      set -x DISTROVER (grep '^VERSION_ID' /etc/os-release| sed 's/^ID=//')
  else if [ (command -v lsb_release >/dev/null) ]
      # linuxbase.org
      set -x DISTRO (lsb_release -si | awk '{print tolower ($0)}')
      set -x DISTROVER (lsb_release -sr | awk '{print tolower ($0)}')
  else if [ -f /etc/lsb-release ]
      # For some versions of Debian/Ubuntu without lsb_release command
      set -x DISTRO (grep '^ID' /etc/lsb-release| sed 's/^DISTRIB_ID=//')
      set -x DISTROVER (grep '^VERSION_ID' /etc/lsb-release| sed 's/^DISTRIB_RELEASE=//')
  else if [ -f /etc/debian_version ]; then
      # Older Debian/Ubuntu/etc.
      set -x DISTRO Debian
      set -x DISTROVER (cat /etc/debian_version)
  else
      set -x DISTRO (uname -s)
      set -x DISTROVER (uname -r)
  end
#+end_src
** 00-locale.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/00-locale.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/00-locale.fish
  # <alexforsale@yahoo.com>

  set -x LANG en_US.UTF-8

  if [ -z $MM_CHARSET ]
    set -x MM_CHARSET $LANG
  end
#+end_src
** 01-xdg_base_directory.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/01-xdg_base_directory.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/01-xdg_base_directory.fish
  # <alexforsale@yahoo.com>

  if [ -z $XDG_CONFIG_HOME ]
      if [ -d $HOME/.config ]
          mkdir -p $HOME/.config
      end
      set -x XDG_CONFIG_HOME $HOME/.config
  end

  if [ -z $XDG_CACHE_HOME ]
      if [ -d $HOME/.cache ]
          mkdir -p $HOME/.cache
      end
      set -x XDG_CACHE_HOME $HOME/.cache
  end

  if [ -z $XDG_DATA_HOME ]
      if [ -d $HOME/.local/share ]
          mkdir -p $HOME/.local/share
      end
      set -x XDG_DATA_HOME $HOME/.local/share
  end

  if [ -z $XDG_DESKTOP_DIR ]
      set -x XDG_DESKTOP_DIR $HOME/Desktop
      mkdir -p $XDG_DESKTOP_DIR
  end
  if [ -z $XDG_DOWNLOAD_DIR ]
      set -x XDG_DOWNLOAD_DIR $HOME/Downloads
      mkdir -p $XDG_DOWNLOAD_DIR
  end
  if [ -z $XDG_TEMPLATES_DIR ]
      set -x XDG_TEMPLATES_DIR $HOME/Templates
      mkdir -p $XDG_TEMPLATES_DIR
  end
  if [ -z $XDG_PUBLICSHARE_DIR ]
      set -x XDG_PUBLICSHARE_DIR $HOME/Public
      mkdir -p $XDG_PUBLICSHARE_DIR
  end
  if [ -z $XDG_DOCUMENTS_DIR ]
      set -x XDG_DOCUMENTS_DIR $HOME/Documents
      mkdir -p $XDG_DOCUMENTS_DIR
  end
  if [ -z $XDG_MUSIC_DIR ]
      set -x XDG_MUSIC_DIR $HOME/Music
      mkdir -p $XDG_MUSIC_DIR
  end
  if [ -z $XDG_PICTURES_DIR ]
      set -x XDG_PICTURES_DIR $HOME/Pictures
      mkdir -p $XDG_PICTURES_DIR
  end
  if [ -z $XDG_VIDEOS_DIR ]
      set -x XDG_VIDEOS_DIR $HOME/Videos
      mkdir -p $XDG_VIDEOS_DIR
  end

  if [ -n $GUIX_LOCPATH ] || [ $DISTRO = "guix" ]
      if [ -d $HOME/.nix-profile/share ]
          set -x XDG_DATA_DIRS "$XDG_DATA_DIRS:$HOME/.nix-profile/share"
      end
  end

#+end_src
