index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-18 Fri 14:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>index</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">index</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge37eeb4">~/.config/fish/config.fish</a>
<ul>
<li><a href="#org05a29c7">interactive settings</a></li>
<li><a href="#orgf5862da">Login shell</a></li>
</ul>
</li>
<li><a href="#org23bffcd">~/config/fish/conf.d</a>
<ul>
<li><a href="#orgb506598">00-distro.fish</a></li>
<li><a href="#orgd0091f2">00-locale.fish</a></li>
<li><a href="#orge2c566e">01-xdg_base_directory.fish</a></li>
<li><a href="#orgcef14ba">02-editors.fish</a></li>
<li><a href="#org8968efd">03-nix.fish</a></li>
<li><a href="#orgbea6f84">04-terminals.fish</a></li>
<li><a href="#orga6e701e">05-filemanagers.fish</a></li>
<li><a href="#org9ed3e81">06-security.fish</a></li>
<li><a href="#orgdb1cb97">07-browsers.fish</a></li>
<li><a href="#orgd1f6df2">08-mail_apps.fish</a></li>
<li><a href="#org480b3e5">99-doom_emacs.fish</a></li>
<li><a href="#orgc9a5427">99-composer.fish</a></li>
<li><a href="#orgc25d900">99-screen.fish</a></li>
<li><a href="#org1bda71f">99-fsharp.fish</a></li>
<li><a href="#orgd50575c">99-elinks.fish</a></li>
<li><a href="#orgf4906b2">99-ccache.fish</a></li>
<li><a href="#orgc516711">99-ghcup.fish</a></li>
<li><a href="#org52fad9e">99-cargo.fish</a></li>
<li><a href="#org5ed88f3">99-ruby.fish</a></li>
<li><a href="#org233e01e">99-go.fish</a></li>
<li><a href="#orgef1fe78">99-virtualenvwrapper.fish</a></li>
<li><a href="#org0c493a1">99-python.fish</a></li>
<li><a href="#org6bf2013">99-nano.fish</a></li>
<li><a href="#org5102378">99-emacs_vterm.fish</a></li>
</ul>
</li>
<li><a href="#org4c1352d">~/.config/fish/functions</a>
<ul>
<li><a href="#org1d8acfa">fish_greeting</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is my <i>Fish</i> shell configuration, as always, nothing fancy.
</p>
<div id="outline-container-orge37eeb4" class="outline-2">
<h2 id="orge37eeb4">~/.config/fish/config.fish</h2>
<div class="outline-text-2" id="text-orge37eeb4">
<p>
From all the shells I've used, this is the most recent. And it is intentionally not fully POSIX compliant, meaning porting POSIX compliant script may require significant rewrite.
</p>

<p>
As for now, just to conditionals for when called as a login shell or when called interactively. Most people used <i>fish</i> as an interactive shell only, meaning the default shell (usually <i>bash</i>) is still used for initializing. But when I used <i>fish</i> I set it up as my default shell (using <i>chsh</i>).
</p>

<p>
to check if you're in interactive or login shell, just run the following snippet:
</p>
<div class="org-src-container">
<pre class="src src-fish">status --is-interactive || echo $status
</pre>
</div>

<p>
and check its output
</p>
</div>
<div id="outline-container-org05a29c7" class="outline-3">
<h3 id="org05a29c7">interactive settings</h3>
<div class="outline-text-3" id="text-org05a29c7">
<div class="org-src-container">
<pre class="src src-fish">if status is-interactive
    # Commands to run in interactive sessions can go here
    [ -d "$HOME/.local/bin" ] &amp;&amp; set -x PATH $HOME/.local/bin $PATH

    # completions
    for dir in /usr/share/fish/completions \
        /usr/share/fish/vendor_completions.d \
        /usr/local/share/fish/completions \
        ~/.config/fish/completions
        if [ -d "$dir" ]
            for files in "$dir/*"
                [ -f $files ] &amp;&amp; source $files
            end
        end
    end
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5862da" class="outline-3">
<h3 id="orgf5862da">Login shell</h3>
<div class="outline-text-3" id="text-orgf5862da">
<p>
This allow us to run <i>fish</i> as a login shell, while still having all the environment variables I would typically have in <i>bash</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>
<div class="org-src-container">
<pre class="src src-fish"># source /etc/profile with bash
if status is-login
    exec bash -c "test -e /etc/profile &amp;&amp; source /etc/profile;\
    exec fish"
end
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org23bffcd" class="outline-2">
<h2 id="org23bffcd">~/config/fish/conf.d</h2>
<div class="outline-text-2" id="text-org23bffcd">
<p>
Mostly just ports from my <a href="https://alexforsale.github.io/dotfiles-shells/">POSIX shell configuration</a>.
</p>
</div>
<div id="outline-container-orgb506598" class="outline-3">
<h3 id="orgb506598">00-distro.fish</h3>
<div class="outline-text-3" id="text-orgb506598">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/00-distro.fish
# &lt;alexforsale@yahoo.com&gt;

if [ -f /etc/os-release ]
    # freedesktop.org and systemd
    set -x DISTRO (grep '^ID=' /etc/os-release| sed 's/^ID=//')
    set -x DISTROVER (grep '^VERSION_ID' /etc/os-release| sed 's/^ID=//')
else if [ (command -v lsb_release &gt;/dev/null) ]
    # linuxbase.org
    set -x DISTRO (lsb_release -si | awk '{print tolower ($0)}')
    set -x DISTROVER (lsb_release -sr | awk '{print tolower ($0)}')
else if [ -f /etc/lsb-release ]
    # For some versions of Debian/Ubuntu without lsb_release command
    set -x DISTRO (grep '^ID' /etc/lsb-release| sed 's/^DISTRIB_ID=//')
    set -x DISTROVER (grep '^VERSION_ID' /etc/lsb-release| sed 's/^DISTRIB_RELEASE=//')
else if [ -f /etc/debian_version ]; then
    # Older Debian/Ubuntu/etc.
    set -x DISTRO Debian
    set -x DISTROVER (cat /etc/debian_version)
else
    set -x DISTRO (uname -s)
    set -x DISTROVER (uname -r)
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0091f2" class="outline-3">
<h3 id="orgd0091f2">00-locale.fish</h3>
<div class="outline-text-3" id="text-orgd0091f2">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/00-locale.fish
# &lt;alexforsale@yahoo.com&gt;

set -x LANG en_US.UTF-8

if [ -z $MM_CHARSET ]
  set -x MM_CHARSET $LANG
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orge2c566e" class="outline-3">
<h3 id="orge2c566e">01-xdg_base_directory.fish</h3>
<div class="outline-text-3" id="text-orge2c566e">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/01-xdg_base_directory.fish
# &lt;alexforsale@yahoo.com&gt;

if [ -z $XDG_CONFIG_HOME ]
    if [ -d $HOME/.config ]
        mkdir -p $HOME/.config
    end
    set -x XDG_CONFIG_HOME $HOME/.config
end

if [ -z $XDG_CACHE_HOME ]
    if [ -d $HOME/.cache ]
        mkdir -p $HOME/.cache
    end
    set -x XDG_CACHE_HOME $HOME/.cache
end

if [ -z $XDG_DATA_HOME ]
    if [ -d $HOME/.local/share ]
        mkdir -p $HOME/.local/share
    end
    set -x XDG_DATA_HOME $HOME/.local/share
end

if [ -z $XDG_DESKTOP_DIR ]
    set -x XDG_DESKTOP_DIR $HOME/Desktop
    mkdir -p $XDG_DESKTOP_DIR
end
if [ -z $XDG_DOWNLOAD_DIR ]
    set -x XDG_DOWNLOAD_DIR $HOME/Downloads
    mkdir -p $XDG_DOWNLOAD_DIR
end
if [ -z $XDG_TEMPLATES_DIR ]
    set -x XDG_TEMPLATES_DIR $HOME/Templates
    mkdir -p $XDG_TEMPLATES_DIR
end
if [ -z $XDG_PUBLICSHARE_DIR ]
    set -x XDG_PUBLICSHARE_DIR $HOME/Public
    mkdir -p $XDG_PUBLICSHARE_DIR
end
if [ -z $XDG_DOCUMENTS_DIR ]
    set -x XDG_DOCUMENTS_DIR $HOME/Documents
    mkdir -p $XDG_DOCUMENTS_DIR
end
if [ -z $XDG_MUSIC_DIR ]
    set -x XDG_MUSIC_DIR $HOME/Music
    mkdir -p $XDG_MUSIC_DIR
end
if [ -z $XDG_PICTURES_DIR ]
    set -x XDG_PICTURES_DIR $HOME/Pictures
    mkdir -p $XDG_PICTURES_DIR
end
if [ -z $XDG_VIDEOS_DIR ]
    set -x XDG_VIDEOS_DIR $HOME/Videos
    mkdir -p $XDG_VIDEOS_DIR
end

if [ -n $GUIX_LOCPATH ] || [ $DISTRO = "guix" ]
    if [ -d $HOME/.nix-profile/share ]
        set -x XDG_DATA_DIRS "$XDG_DATA_DIRS:$HOME/.nix-profile/share"
    end
end

</pre>
</div>
</div>
</div>
