index.org
** 04-terminals.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/04-terminals.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/04-terminals.fish
  # ${TERMINAL} apps
  # <alexforsale@yahoo.com>

  for term in alacritty urxvt xterm gnome-terminal terminator tilda guake konsole lxterminal yakuake st terminology xfce4-terminal
      if [ (command -v $term) ]
          [ -z $TERMINAL ] && set -x TERMINAL $term
      end
  end
#+end_src
** 05-filemanagers.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/05-filemanagers.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/05-filemanagers.sh
  # filemanager configuration
  # <alexforsale@yahoo.com>

  for file in ranger pcmanfm thunar caja nautilus nemo dolphin rox
      if [ (command -v $file) ]
          [ -z $FILE ] && set -e FILE $file
      end
  end
#+end_src
** 06-security.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/06-security.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/06-security.fish
  # doom emacs path
  # <alexforsale@yahoo.com>

  set -x GPG_TTY (tty)

  # https://wiki.gentoo.org/wiki/GnuPG#Automatically_starting_the_GPG_agent
  if [ -n $SSH_CONNECTION ]
      set -x PINENTRY_USER_DATA "USE_CURSES=1"
  end

  switch $DISTRO
      case freebsd
          for i in curses gnome3 gtk2 qt5
              if [ (command -v pinentry-$i) ]
                  set _PINENTRY (command -v pinentry-$i)
              else
                  set _PINENTRY (command -v pinentry)
              end
          end
      case '*'
          if [ -z "(pgrep -u $USER -x gpg-agent)" ]
              gpg-agent --pinentry-program (command -v pinentry) >/dev/null
          end
  end

#+end_src
** 07-browsers.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/07-browsers.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/07-browser.fish
  # ${BROWSER} configuration
  # <alexforsale@yahoo.com>

  # Browser
  for browser in firefox google-chrome-stable midori qutebrowser chromium seamonkey falkon
      if [ (command -v browser) ]
          [ -z $BROWSER ] && set -x BROWSER $browser
      else
          for term_browser in elinks lynx w3m links
              if [ (command -v term_browser) ]
                  [ -z $BROWSER ] && set -x BROWSER $term_browser
              end
          end
      end
  end

#+end_src
** 08-mail_apps.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/08-mail_apps.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/08-mail_apps.sh
  # ${MAIL_APP} configuration
  # <alexforsale@yahoo.com>

  for mail_app in alpine balsa evolution geary kmail kube mailspring thunderbird
      if [ (command -v $mail_app) ]
          [ -z $MAIL_APP ] && set -x MAIL_APP $mail_app
      end
  end
#+end_src
** 99-doom_emacs.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-doom_emacs.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/99-doom_emacs.sh
  # doom emacs path
  # <alexforsale@yahoo.com>

  if [ (command -v emacs) ] &&
          [ -e $HOME/.emacs.d/bin/doom ]
      [ ! (command -v doom) ] &&
          set -x PATH $PATH $HOME/.emacs.d/bin
  else if [ -d $HOME/.config/doom/bin ]
      [ ! (command -v doom) ]
      set -x PATH $PATH $HOME/.config/doom/bin
  end

#+end_src
** 99-composer.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-composer.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-composer.fish
  # <alexforsale@yahoo.com>

  if command -v composer &>/dev/null and
      test -d $HOME/.config/composer/vendor/bin
      set -x PATH $PATH $HOME/.config/composer/vendor/bin
  end
#+end_src
** 99-screen.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-screen.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-screen.fish
  # configuration for GNU Screen
  # <alexforsale@yahoo.com>

  if [ (command -v screen) ] &&
          [ ! -d $XDG_CONFIG_HOME/screen ]
      if [ -d $HOME/.screen ]
          mv $HOME/.screen $XDG_CONFIG_HOME/screen
      else
          mkdir -p $XDG_CONFIG_HOME/screen
      end
  end
  set -x SCREENDIR $XDG_CONFIG_HOME/screen
  chmod 700 $SCREENDIR
  set -x SCREENRC $SCREENDIR/config
#+end_src
** 99-fsharp.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-fsharp.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-fsharp.fish
  # configuration for F#
  # <alexforsale@yahoo.com>

  if [ (command -v dotnet) ] &&
      [ -d $HOME/.dotnet/tools ]
      set -x PATH $PATH $HOME/.dotnet/tools
  end
#+end_src
** 99-elinks.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-elinks.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-elinks.fish
  # configuration for elinks
  # <alexforsale@yahoo.com>


  if [ (command -v elinks) ] &&
          [ -d $XDG_CONFIG_HOME/elinks ] &&
          [ -d $HOME/.elinks ]
      mv $HOME/.elinks $XDG_CONFIG_HOME/elinks
  else
      mkdir -p $XDG_CONFIG_HOME/elinks
  end
  set -x ELINKS_CONFDIR $XDG_CONFIG_HOME/elinks
#+end_src
** 99-ccache.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-ccache.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-ccache.fish
  # configuration for ccache
  # <alexforsale@yahoo.com>

  if [ (command -v ccache) ] &&
      [ -d /usr/lib/ccache/bin ]
      set -x PATH /usr/lib/ccache/bin $PATH
  end

  switch $DISTRO
      case gentoo
          [ -r /var/cache/ccache ] &&
          set -x CCACHE_DIR /var/cache/ccache
  end
#+end_src
** 99-ghcup.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-ccache.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-ghcup.fish
  # ghcup configuration
  # <alexforsale@yahoo.com>

  if [ (command -v ghcup) ]
      [ -d $HOME/.cabal/bin ] && set -x PATH $HOME/.cabal/bin $PATH
      [ -d $HOME/.ghcup/bin ] && set -x PATH $HOME/.ghcup/bin $PATH
  end
#+end_src
** 99-cargo.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-cargo.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-cargo.fish
  # cargo configuration
  # https://wiki.archlinux.org/index.php/Rust#Cargo
  # <alexforsale@yahoo.com>

  if [ -d $HOME/.cargo/bin ]
      set -x PATH $HOME/.cargo/bin $PATH
  end
#+end_src
** 99-ruby.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-ruby.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-ruby.fish
  # ruby configuration
  # <alexforsale@yahoo.com>

  if [ (command -v ruby) ] &&
          [ -d (ruby -e 'print Gem.user_dir')/bin ]
      set -x PATH (ruby -e 'print Gem.user_dir')/bin $PATH
  end
#+end_src
** 99-go.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-go.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-go.fish
  # $GOPATH configuration
  # <alexforsale@yahoo.com>

  if [ (command -v go) ]
      # set GOPATH to ~/.local so we don't need
      # to add more PATH
      set -x GOPATH $HOME/.local
  end
#+end_src

