index.html
<div id="outline-container-orgbea6f84" class="outline-3">
<h3 id="orgbea6f84">04-terminals.fish</h3>
<div class="outline-text-3" id="text-orgbea6f84">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/04-terminals.fish
# ${TERMINAL} apps
# &lt;alexforsale@yahoo.com&gt;

for term in alacritty urxvt xterm gnome-terminal terminator tilda guake konsole lxterminal yakuake st terminology xfce4-terminal
    if [ (command -v $term) ]
        [ -z $TERMINAL ] &amp;&amp; set -x TERMINAL $term
    end
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orga6e701e" class="outline-3">
<h3 id="orga6e701e">05-filemanagers.fish</h3>
<div class="outline-text-3" id="text-orga6e701e">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/05-filemanagers.sh
# filemanager configuration
# &lt;alexforsale@yahoo.com&gt;

for file in ranger pcmanfm thunar caja nautilus nemo dolphin rox
    if [ (command -v $file) ]
        [ -z $FILE ] &amp;&amp; set -e FILE $file
    end
end
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ed3e81" class="outline-3">
<h3 id="org9ed3e81">06-security.fish</h3>
<div class="outline-text-3" id="text-org9ed3e81">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/06-security.fish
# doom emacs path
# &lt;alexforsale@yahoo.com&gt;

set -x GPG_TTY (tty)

# https://wiki.gentoo.org/wiki/GnuPG#Automatically_starting_the_GPG_agent
if [ -n $SSH_CONNECTION ]
    set -x PINENTRY_USER_DATA "USE_CURSES=1"
end

switch $DISTRO
    case freebsd
        for i in curses gnome3 gtk2 qt5
            if [ (command -v pinentry-$i) ]
                set _PINENTRY (command -v pinentry-$i)
            else
                set _PINENTRY (command -v pinentry)
            end
        end
    case '*'
        if [ -z "(pgrep -u $USER -x gpg-agent)" ]
            gpg-agent --pinentry-program (command -v pinentry) &gt;/dev/null
        end
end

</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb1cb97" class="outline-3">
<h3 id="orgdb1cb97">07-browsers.fish</h3>
<div class="outline-text-3" id="text-orgdb1cb97">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/07-browser.fish
# ${BROWSER} configuration
# &lt;alexforsale@yahoo.com&gt;

# Browser
for browser in firefox google-chrome-stable midori qutebrowser chromium seamonkey falkon
    if [ (command -v browser) ]
        [ -z $BROWSER ] &amp;&amp; set -x BROWSER $browser
    else
        for term_browser in elinks lynx w3m links
            if [ (command -v term_browser) ]
                [ -z $BROWSER ] &amp;&amp; set -x BROWSER $term_browser
            end
        end
    end
end

</pre>
</div>
</div>
</div>
<div id="outline-container-orgd1f6df2" class="outline-3">
<h3 id="orgd1f6df2">08-mail_apps.fish</h3>
<div class="outline-text-3" id="text-orgd1f6df2">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/08-mail_apps.sh
# ${MAIL_APP} configuration
# &lt;alexforsale@yahoo.com&gt;

for mail_app in alpine balsa evolution geary kmail kube mailspring thunderbird
    if [ (command -v $mail_app) ]
        [ -z $MAIL_APP ] &amp;&amp; set -x MAIL_APP $mail_app
    end
end
</pre>
</div>
</div>
</div>
<div id="outline-container-org480b3e5" class="outline-3">
<h3 id="org480b3e5">99-doom_emacs.fish</h3>
<div class="outline-text-3" id="text-org480b3e5">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-doom_emacs.sh
# doom emacs path
# &lt;alexforsale@yahoo.com&gt;

if [ (command -v emacs) ] &amp;&amp;
        [ -e $HOME/.emacs.d/bin/doom ]
    [ ! (command -v doom) ] &amp;&amp;
        set -x PATH $PATH $HOME/.emacs.d/bin
else if [ -d $HOME/.config/doom/bin ]
    [ ! (command -v doom) ]
    set -x PATH $PATH $HOME/.config/doom/bin
end

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9a5427" class="outline-3">
<h3 id="orgc9a5427">99-composer.fish</h3>
<div class="outline-text-3" id="text-orgc9a5427">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-composer.fish
# &lt;alexforsale@yahoo.com&gt;

if command -v composer &amp;&gt;/dev/null and
    test -d $HOME/.config/composer/vendor/bin
    set -x PATH $PATH $HOME/.config/composer/vendor/bin
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc25d900" class="outline-3">
<h3 id="orgc25d900">99-screen.fish</h3>
<div class="outline-text-3" id="text-orgc25d900">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-screen.fish
# configuration for GNU Screen
# &lt;alexforsale@yahoo.com&gt;

if [ (command -v screen) ] &amp;&amp;
        [ ! -d $XDG_CONFIG_HOME/screen ]
    if [ -d $HOME/.screen ]
        mv $HOME/.screen $XDG_CONFIG_HOME/screen
    else
        mkdir -p $XDG_CONFIG_HOME/screen
    end
end
set -x SCREENDIR $XDG_CONFIG_HOME/screen
chmod 700 $SCREENDIR
set -x SCREENRC $SCREENDIR/config
</pre>
</div>
</div>
</div>
<div id="outline-container-org1bda71f" class="outline-3">
<h3 id="org1bda71f">99-fsharp.fish</h3>
<div class="outline-text-3" id="text-org1bda71f">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-fsharp.fish
# configuration for F#
# &lt;alexforsale@yahoo.com&gt;

if [ (command -v dotnet) ] &amp;&amp;
    [ -d $HOME/.dotnet/tools ]
    set -x PATH $PATH $HOME/.dotnet/tools
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd50575c" class="outline-3">
<h3 id="orgd50575c">99-elinks.fish</h3>
<div class="outline-text-3" id="text-orgd50575c">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-elinks.fish
# configuration for elinks
# &lt;alexforsale@yahoo.com&gt;


if [ (command -v elinks) ] &amp;&amp;
        [ -d $XDG_CONFIG_HOME/elinks ] &amp;&amp;
        [ -d $HOME/.elinks ]
    mv $HOME/.elinks $XDG_CONFIG_HOME/elinks
else
    mkdir -p $XDG_CONFIG_HOME/elinks
end
set -x ELINKS_CONFDIR $XDG_CONFIG_HOME/elinks
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4906b2" class="outline-3">
<h3 id="orgf4906b2">99-ccache.fish</h3>
<div class="outline-text-3" id="text-orgf4906b2">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-ccache.fish
# configuration for ccache
# &lt;alexforsale@yahoo.com&gt;

if [ (command -v ccache) ] &amp;&amp;
    [ -d /usr/lib/ccache/bin ]
    set -x PATH /usr/lib/ccache/bin $PATH
end

switch $DISTRO
    case gentoo
        [ -r /var/cache/ccache ] &amp;&amp;
        set -x CCACHE_DIR /var/cache/ccache
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc516711" class="outline-3">
<h3 id="orgc516711">99-ghcup.fish</h3>
<div class="outline-text-3" id="text-orgc516711">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-ghcup.fish
# ghcup configuration
# &lt;alexforsale@yahoo.com&gt;

if [ (command -v ghcup) ]
    [ -d $HOME/.cabal/bin ] &amp;&amp; set -x PATH $HOME/.cabal/bin $PATH
    [ -d $HOME/.ghcup/bin ] &amp;&amp; set -x PATH $HOME/.ghcup/bin $PATH
end
</pre>
</div>
</div>
</div>
<div id="outline-container-org52fad9e" class="outline-3">
<h3 id="org52fad9e">99-cargo.fish</h3>
<div class="outline-text-3" id="text-org52fad9e">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-cargo.fish
# cargo configuration
# https://wiki.archlinux.org/index.php/Rust#Cargo
# &lt;alexforsale@yahoo.com&gt;

if [ -d $HOME/.cargo/bin ]
    set -x PATH $HOME/.cargo/bin $PATH
end
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ed88f3" class="outline-3">
<h3 id="org5ed88f3">99-ruby.fish</h3>
<div class="outline-text-3" id="text-org5ed88f3">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-ruby.fish
# ruby configuration
# &lt;alexforsale@yahoo.com&gt;

if [ (command -v ruby) ] &amp;&amp;
        [ -d (ruby -e 'print Gem.user_dir')/bin ]
    set -x PATH (ruby -e 'print Gem.user_dir')/bin $PATH
end
</pre>
</div>
</div>
</div>
<div id="outline-container-org233e01e" class="outline-3">
<h3 id="org233e01e">99-go.fish</h3>
<div class="outline-text-3" id="text-org233e01e">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-go.fish
# $GOPATH configuration
# &lt;alexforsale@yahoo.com&gt;

if [ (command -v go) ]
    # set GOPATH to ~/.local so we don't need
    # to add more PATH
    set -x GOPATH $HOME/.local
end
</pre>
</div>
</div>
</div>
