index.org
** 99-virtualenvwrapper.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-virtualenvwrapper.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-virtualenvwrapper.fish
  # $GOPATH configuration
  # <alexforsale@yahoo.com>

  [ -d $HOME/.virtualenvs ] && set -x WORKON_HOME $HOME/.virtualenvs

  [ -x /usr/bin/virtualenvwrapper.sh ] &&
  exec bash -c "source /usr/bin/virtualenvwrapper.sh"
#+end_src

** 99-python.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-python.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-python.fish
  # Python configuration
  # <alexforsale@yahoo.com>

  [ $(command -v pipenv) ] && set -x PIPENV_VENV_IN_PROJECT 1

  if [ $(command -v pyenv) ]
      set -Ux PYENV_ROOT $HOME/.pyenv
      fish_add_path $PYENV_ROOT/bin
      pyenv init - | source
  end

#+end_src

** 99-nano.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-nano.fish :padline no :shebang #!/usr/bin/env fish
:END:

#+begin_src fish
  # ~/.config/fish/conf.d/99-nano.fish
  # GNU Nano configuration
  # <alexforsale@yahoo.com>

  if [ $(command -v nano) ]
      if [ ! -d $XDG_CONFIG_HOME/nano ]
          mkdir -p $XDG_CONFIG_HOME/nano
          if [ -f $HOME/.nanorc ]
              if [ ! -f $XDG_CONFIG_HOME/nano/nanorc ]
              mv $HOME/.nanorc $XDG_CONFIG_HOME/nano/nanorc
          else
              mv $HOME/.nanorc $XDG_CONFIG_HOME/nano/nanorc.bak
          end
      end
      [ ! -d $XDG_CONFIG_HOME/nano/backups ] && mkdir -pv $XDG_CONFIG_HOME/nano/backups
      end
  end
#+end_src

** 99-emacs_vterm.fish
:PROPERTIES:
:header-args: :tangle .config/fish/conf.d/99-emacs_vterm.fish :padline no :shebang #!/usr/bin/env fish
:END:
#+begin_src fish
  # ~/.config/fish/conf.d/99-emacs-vterm.sh
  # https://github.com/akermu/emacs-libvterm
  # <alexforsale@yahoo.com>

  function vterm_printf
      if begin
              [ -n "$TMUX" ]; and string match -q -r "screen|tmux" "$TERM"
          end
          # tell tmux to pass the escape sequences through
          printf "\ePtmux;\e\e]%s\007\e\\" "$argv"
      else if string match -q -- "screen*" "$TERM"
          # GNU screen (screen, screen-256color, screen-256color-bce)
          printf "\eP\e]%s\007\e\\" "$argv"
      else
          printf "\e]%s\e\\" "$argv"
      end
  end

  if [ "$INSIDE_EMACS" = vterm ]
      function clear
          vterm_printf "51;Evterm-clear-scrollback"
          tput clear
      end
  end

  function fish_title
      hostname
      echo ":"
      prompt_pwd
  end

  function vterm_prompt_end
      vterm_printf '51;A'(whoami)'@'(hostname)':'(pwd)
  end
  functions --copy fish_prompt vterm_old_fish_prompt
  function fish_prompt --description 'Write out the prompt; do not replace this. Instead, put this at end of your file.'
      # Remove the trailing newline from the original prompt. This is done
      # using the string builtin from fish, but to make sure any escape codes
      # are correctly interpreted, use %b for printf.
      printf "%b" (string join "\n" (vterm_old_fish_prompt))
      vterm_prompt_end
  end

  function vterm_cmd --description 'Run an Emacs command among the ones been defined in vterm-eval-cmds.'
      set -l vterm_elisp ()
      for arg in $argv
          set -a vterm_elisp (printf '"%s" ' (string replace -a -r '([\\\\"])' '\\\\\\\\$1' $arg))
      end
      vterm_printf '51;E'(string join '' $vterm_elisp)
  end

  function find_file
      set -q argv[1]; or set argv[1] "."
      vterm_cmd find-file (realpath "$argv")
  end

  function say
      vterm_cmd message "%s" "$argv"
  end
#+end_src

* ~/.config/fish/functions
** fish_greeting
:PROPERTIES:
:header-args: :tangle .config/fish/functions/fish_greeting.fish :padline no :shebang #!/usr/bin/env fish :mkdirp t
:END:

#+begin_src fish
  function fish_greeting
      echo "Welcome to "(fish --version)", the friendly interactive shell"
      echo Type (set_color green; echo -n help) (set_color normal; echo -n "for instructions on how to use fish")
  end

#+end_src
This is basically the default greetings, the only change is I've added the version.

* Footnotes

[fn:1] https://wiki.archlinux.org/title/Fish
