index.html

<div id="outline-container-orgef1fe78" class="outline-3">
<h3 id="orgef1fe78">99-virtualenvwrapper.fish</h3>
<div class="outline-text-3" id="text-orgef1fe78">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-virtualenvwrapper.fish
# $GOPATH configuration
# &lt;alexforsale@yahoo.com&gt;

[ -d $HOME/.virtualenvs ] &amp;&amp; set -x WORKON_HOME $HOME/.virtualenvs

[ -x /usr/bin/virtualenvwrapper.sh ] &amp;&amp;
exec bash -c "source /usr/bin/virtualenvwrapper.sh"
</pre>
</div>
</div>
</div>

<div id="outline-container-org0c493a1" class="outline-3">
<h3 id="org0c493a1">99-python.fish</h3>
<div class="outline-text-3" id="text-org0c493a1">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-python.fish
# Python configuration
# &lt;alexforsale@yahoo.com&gt;

[ $(command -v pipenv) ] &amp;&amp; set -x PIPENV_VENV_IN_PROJECT 1

if [ $(command -v pyenv) ]
    set -Ux PYENV_ROOT $HOME/.pyenv
    fish_add_path $PYENV_ROOT/bin
    pyenv init - | source
end

</pre>
</div>
</div>
</div>

<div id="outline-container-org6bf2013" class="outline-3">
<h3 id="org6bf2013">99-nano.fish</h3>
<div class="outline-text-3" id="text-org6bf2013">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-nano.fish
# GNU Nano configuration
# &lt;alexforsale@yahoo.com&gt;

if [ $(command -v nano) ]
    if [ ! -d $XDG_CONFIG_HOME/nano ]
        mkdir -p $XDG_CONFIG_HOME/nano
        if [ -f $HOME/.nanorc ]
            if [ ! -f $XDG_CONFIG_HOME/nano/nanorc ]
            mv $HOME/.nanorc $XDG_CONFIG_HOME/nano/nanorc
        else
            mv $HOME/.nanorc $XDG_CONFIG_HOME/nano/nanorc.bak
        end
    end
    [ ! -d $XDG_CONFIG_HOME/nano/backups ] &amp;&amp; mkdir -pv $XDG_CONFIG_HOME/nano/backups
    end
end
</pre>
</div>
</div>
</div>

<div id="outline-container-org5102378" class="outline-3">
<h3 id="org5102378">99-emacs_vterm.fish</h3>
<div class="outline-text-3" id="text-org5102378">
<div class="org-src-container">
<pre class="src src-fish"># ~/.config/fish/conf.d/99-emacs-vterm.sh
# https://github.com/akermu/emacs-libvterm
# &lt;alexforsale@yahoo.com&gt;

function vterm_printf
    if begin
            [ -n "$TMUX" ]; and string match -q -r "screen|tmux" "$TERM"
        end
        # tell tmux to pass the escape sequences through
        printf "\ePtmux;\e\e]%s\007\e\\" "$argv"
    else if string match -q -- "screen*" "$TERM"
        # GNU screen (screen, screen-256color, screen-256color-bce)
        printf "\eP\e]%s\007\e\\" "$argv"
    else
        printf "\e]%s\e\\" "$argv"
    end
end

if [ "$INSIDE_EMACS" = vterm ]
    function clear
        vterm_printf "51;Evterm-clear-scrollback"
        tput clear
    end
end

function fish_title
    hostname
    echo ":"
    prompt_pwd
end

function vterm_prompt_end
    vterm_printf '51;A'(whoami)'@'(hostname)':'(pwd)
end
functions --copy fish_prompt vterm_old_fish_prompt
function fish_prompt --description 'Write out the prompt; do not replace this. Instead, put this at end of your file.'
    # Remove the trailing newline from the original prompt. This is done
    # using the string builtin from fish, but to make sure any escape codes
    # are correctly interpreted, use %b for printf.
    printf "%b" (string join "\n" (vterm_old_fish_prompt))
    vterm_prompt_end
end

function vterm_cmd --description 'Run an Emacs command among the ones been defined in vterm-eval-cmds.'
    set -l vterm_elisp ()
    for arg in $argv
        set -a vterm_elisp (printf '"%s" ' (string replace -a -r '([\\\\"])' '\\\\\\\\$1' $arg))
    end
    vterm_printf '51;E'(string join '' $vterm_elisp)
end

function find_file
    set -q argv[1]; or set argv[1] "."
    vterm_cmd find-file (realpath "$argv")
end

function say
    vterm_cmd message "%s" "$argv"
end
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4c1352d" class="outline-2">
<h2 id="org4c1352d">~/.config/fish/functions</h2>
<div class="outline-text-2" id="text-org4c1352d">
</div>
<div id="outline-container-org1d8acfa" class="outline-3">
<h3 id="org1d8acfa">fish_greeting</h3>
<div class="outline-text-3" id="text-org1d8acfa">
<div class="org-src-container">
<pre class="src src-fish">function fish_greeting
    echo "Welcome to "(fish --version)", the friendly interactive shell"
    echo Type (set_color green; echo -n help) (set_color normal; echo -n "for instructions on how to use fish")
end

</pre>
</div>
<p>
This is basically the default greetings, the only change is I've added the version.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://wiki.archlinux.org/title/Fish">https://wiki.archlinux.org/title/Fish</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2024-11-05 Tue 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2025-04-18 Fri 14:15</p>
</div>
</body>
</html>
